In [32]:
import pandas as pd
import numpy as np

In [33]:
data = np.random.randint(10,100,15).reshape(5,3)

df = pd.DataFrame(data, index = ['a','c','e','f','h'], columns = ['column1','column2','column3'])
df

   column1  column2  column3
a       81       89       53
c       28       29       70
e       63       85       93
f       99       84       80
h       41       80       49

In [34]:
df = df.reindex(['a','b','c','d','e','f','g','h'])
df

   column1  column2  column3
a     81.0     89.0     53.0
b      NaN      NaN      NaN
c     28.0     29.0     70.0
d      NaN      NaN      NaN
e     63.0     85.0     93.0
f     99.0     84.0     80.0
g      NaN      NaN      NaN
h     41.0     80.0     49.0

In [35]:
newColumn = [np.nan,30,np.nan,51,np.nan,30,np.nan,10]
df["column4"] = newColumn
df

   column1  column2  column3  column4
a     81.0     89.0     53.0      NaN
b      NaN      NaN      NaN     30.0
c     28.0     29.0     70.0      NaN
d      NaN      NaN      NaN     51.0
e     63.0     85.0     93.0      NaN
f     99.0     84.0     80.0     30.0
g      NaN      NaN      NaN      NaN
h     41.0     80.0     49.0     10.0

In [36]:
df.isnull()
df.notnull()
df.isnull().sum()

column1    3
column2    3
column3    3
column4    4
dtype: int64

In [37]:
df["column1"].isnull().sum()

3

In [38]:
df[df["column1"].isnull()]

   column1  column2  column3  column4
b      NaN      NaN      NaN     30.0
d      NaN      NaN      NaN     51.0
g      NaN      NaN      NaN      NaN

In [39]:
df[df["column1"].notnull()]

   column1  column2  column3  column4
a     81.0     89.0     53.0      NaN
c     28.0     29.0     70.0      NaN
e     63.0     85.0     93.0      NaN
f     99.0     84.0     80.0     30.0
h     41.0     80.0     49.0     10.0

In [40]:
df[df["column1"].notnull()]["column1"]

a    81.0
c    28.0
e    63.0
f    99.0
h    41.0
Name: column1, dtype: float64

In [42]:
result = df.drop("column1", axis = 1)           # This is not in-place/ in-memory operation
result = df.drop(["column1","column2"], axis = 1)
result = df.drop('a', axis = 0)
result = df.drop(['a','b','h'], axis = 0)

In [ ]:
result = df.dropna() # axis = 0 => x-axis
result = df.dropna(axis = 1) # axis = 1 => y-axis
result = df.dropna(how = "any")
result = df.dropna(how = "all")
result = df.dropna(subset  = ["column1","column2"], how = "all")
result = df.dropna(subset  = ["column1","column2"], how = "any")
result = df.dropna(thresh = 2)
result = df.dropna(thresh = 3) # en az sayıda normal veri

result = df.fillna(value = 'no input')
result = df.fillna(value = 1)

In [ ]:
df.sum()

column1    240.0
column2    212.0
column3    250.0
column4    121.0
dtype: float64

In [ ]:
df.sum().sum()

823.0

In [ ]:
df.isnull().sum()

column1    3
column2    3
column3    3
column4    4
dtype: int64

In [ ]:
df.isnull().sum().sum()

13

In [ ]:
def ortalama(df):
    toplam = df.sum().sum()
    adet = df.size - df.isnull().sum().sum()
    return toplam / adet

result = df.fillna(value = ortalama(df))

print(result)

     column1    column2    column3    column4
a  32.000000  18.000000  73.000000  43.315789
b  43.315789  43.315789  43.315789  30.000000
c  59.000000  12.000000  80.000000  43.315789
d  43.315789  43.315789  43.315789  51.000000
e  55.000000  50.000000  51.000000  43.315789
f  77.000000  81.000000  34.000000  30.000000
g  43.315789  43.315789  43.315789  43.315789
h  17.000000  51.000000  12.000000  10.000000